In [1]:
import pandas as pd

In [2]:
purchase_df = pd.read_csv("purchase_data.csv")

In [3]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
#Total Number of Players
players = purchase_df["SN"].value_counts()
playerTotal = len(players)
playerTotal_df = pd.DataFrame({"Total Players": [playerTotal]})
totalnum = int(playerTotal_df.iloc[0,0])
#totalnum

In [5]:
#Number of Unique Items
items = purchase_df["Item ID"].value_counts()
itemTotal = len(items)
#itemTotal

In [6]:
totalPrice = round(purchase_df["Price"].sum(), 2)
#totalPrice

In [7]:
purchases = purchase_df["Purchase ID"].value_counts()
purchaseTotal = len(purchases)
#purchaseTotal

In [8]:
averagePrice = round(totalPrice/purchaseTotal, 2)
#averagePrice

In [16]:
#Purchasing Analysis (Total)
purchaseAnalysis_df = pd.DataFrame({"Number of Unique Items": [itemTotal], "Average Purchase Price": [averagePrice], "Total Number of Purchases": [purchaseTotal], "Total Revenue": [totalPrice]})
purchaseAnalysis_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.05,780,2379.77

In [10]:
#Beginning of Gender Demographics Work
snGender_df = purchase_df[["SN", "Gender"]]
uniqueGenSn_df = snGender_df.drop_duplicates()
#uniqueGenSn_df

In [11]:
genderGroup = uniqueGenSn_df.groupby(["Gender"])
gender_df = genderGroup.count()
#gender_df

In [12]:
percentGender = gender_df["SN"]/ totalnum
#percentGender

In [13]:
gender_df["Percentage of Players"] = percentGender
#gender_df

In [15]:
gender_df.rename(columns={"SN":"Total Count"}, inplace=True)
gender_df

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [17]:
#Beginning of Purchasing Analysis (Gender)
genPur_df = purchase_df[["Purchase ID", "SN", "Gender", "Price"]]
genPur_df

     Purchase ID             SN  Gender  Price
0              0        Lisim78    Male   3.53
1              1    Lisovynya38    Male   1.56
2              2     Ithergue48    Male   4.88
3              3  Chamassasya86    Male   3.27
4              4      Iskosia90    Male   1.44
..           ...            ...     ...    ...
775          775     Aethedru70  Female   3.54
776          776         Iral74    Male   1.63
777          777     Yathecal72    Male   3.46
778          778        Sisur91    Male   4.19
779          779      Ennrian78    Male   4.60

[780 rows x 4 columns]

In [21]:
Count = genPur_df.groupby(["Gender"])
Count_df = Count.count()
Count_df

                       Purchase ID   SN  Price
Gender
Female                         113  113    113
Male                           652  652    652
Other / Non-Disclosed           15   15     15

In [23]:
purCount = Count_df["Purchase ID"]
purCount

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [25]:
avg_df = Count.mean()
avg_df

                       Purchase ID     Price
Gender
Female                  379.380531  3.203009
Male                    392.516871  3.017853
Other / Non-Disclosed   334.600000  3.346000

In [26]:
priceAvg = avg_df["Price"]
priceAvg

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [27]:
sum_df = Count.sum()
sum_df

                       Purchase ID    Price
Gender
Female                       42870   361.94
Male                        255921  1967.64
Other / Non-Disclosed         5019    50.19

In [28]:
totalPrice = sum_df["Price"]
totalPrice

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [29]:
personGroup = genPur_df.groupby(["Gender", "SN"])
personGroupTotal_df = personGroup.sum()
personGroupTotal_df

                                     Purchase ID  Price
Gender                SN
Female                Adastirin33            142   4.48
                      Aerithllora36          852   8.64
                      Aethedru70             775   3.54
                      Aidain51               516   3.45
                      Aiduesu86              429   4.48
...                                          ...    ...
Other / Non-Disclosed Lirtim36               401   1.33
                      Maluncil97            1178   5.28
                      Rairith81              350   2.22
                      Siarithria38           769   6.91
                      Sundim98               111   4.75

[576 rows x 2 columns]

In [30]:
genderPers = personGroupTotal_df.groupby(["Gender"])
genderPers_df = genderPers.mean()
genderPers_df

                       Purchase ID     Price
Gender
Female                  529.259259  4.468395
Male                    528.762397  4.065372
Other / Non-Disclosed   456.272727  4.562727

In [ ]:
#Display Player Count
playerTotal_df

In [ ]:
#Purchasing Analysis w/ Formatting
purchaseAnalysis_df["Average Purchase Price"] = purchaseAnalysis_df["Average Purchase Price"].astype(float).map("${:,.2f}".format)
purchaseAnalysis_df["Total Revenue"] = purchaseAnalysis_df["Total Revenue"].astype(float).map("${:,.2f}".format)

In [ ]:
#Display Purchasing Analysis(Total)
purchaseAnalysis_df

In [ ]:
#Formatting for Gender Analysis
gender_df["Percentage of Players"] = gender_df["Percentage of Players"].map("{:,.2%}".format)

In [ ]:
#Display Gender Demographics
gender_df